# SetColorName

## Description
Sets the color name of the specified color index.

```pascal
FUNCTION SetColorName(
				ColorIndex : INTEGER;
				ColorName  : STRING): BOOLEAN;
```

```python
def vs.SetColorName(ColorIndex, ColorName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|ColorIndex|INTEGER|The index of the color to be named.|
|ColorName|STRING|The new name of the color specified by the index.|

## See Also
VS Functions:
GetColorName

## Version
Availability: from Vectorworks 2011

## Category
* Object Names